import React, { useState } from 'react';
import Slider from 'react-slick';
import 'slick-carousel/slick/slick.css';
import 'slick-carousel/slick/slick-theme.css';
import { Link } from 'react-router-dom';

const DTourpackges = () => {
  const [tourPackages] = useState([
    {
      id: 1,
      date: 'दि.१५ डिसेंबर २०२३ ते २४ डिसेंबर २०२३',
      name: ' आयोजित गुजरात सहल',
      images: [
        'https://media.istockphoto.com/id/483067712/photo/akshardham-temple-new-delhi-india.webp?b=1&s=170667a&w=0&k=20&c=OwF-pL8Nv2NZitq6XisLubGopmFdQAeRhONezlcIAIs=',
        'https://media.istockphoto.com/id/177800537/photo/bay-and-harbor-view-of-dwarka-gujarat-india.webp?b=1&s=170667a&w=0&k=20&c=Ofnvzq5CFGuFHDvrsWfvDPZ9FovkftpdLqt18ByLjWQ=',
        'https://media.istockphoto.com/id/1338639354/photo/wildlife-at-its-best.webp?b=1&s=170667a&w=0&k=20&c=H3gxTc8zt7_TIdQr1857ud1cT2L9ZdVeNdW_-lHRJOo=',
      ],
      duration: '०९ रात्री १० दिवस',
      locations: ['अहमदाबाद, वडोदरा, स्टॅच्यू ऑफ युनिटी, कुबेर भंडारी, द्वारका, बेट द्वारका, नीलकंठधाम, सोमनाथ, निळकंठेश्वर, जुनागड, गिरनार, प्रभासपाटण, राणी की वाव, देहोत्सर्गभल्लीकातीर्थ, पोरबंदर, सूर्य मंदिर'],
      descriptiondetails:`१५ डिसेंबर:- पहिला दिवस 
      पुणे स्टेशन वरून संध्याकाळी ६:५० वा भरूच साठी ट्रेन भरुच कडे प्रस्थान.
      
      १६ डिसेंबर:- दुसरा दिवस 
      पहाटे २:२१ वा. भरुच रेल्वे स्टेशन वर उतरून तेथून बस ने स्टॅच्यू ऑफ युनिटी कडे प्रवास हे अंतर १०० की.मी आहे. 
      तिथे पोहचल्या नंतर फ्रेश होऊन स्टॅच्यू ऑफ युनिटी पाहणे.
      भारतातील स्वातंत्र्य चळवळीचे नेते सरदार वल्लभभाई पटेल यांचा हा पुतळा १८२ मीटर (५९७ फूट) उंचीचा असून हा जगातील सर्वात उंच पुतळा आहे. तिथून पुढे दुपारी जेवण करून कुबेर भंडारी मंदिर पाहणार आहोत तिथे भगवान शिवाचे स्वयंभू शिवलिंग आहे कर्णाळी गावात नर्मदा नदी च्या काठावर सुमारे ८०० फूट उंची वर वसलेले हे मंदिर २५०० वर्ष जुने आहे. नीलकंठ धाम हॉटेल मुक्काम.
      
      १७ डिसेंबर:- तिसरा दिवस
      सकाळी नाष्टा करून नीलकंठ धाम मंदिर पाहणे हे भव्य मंदिर नर्मदा नदी च्या काठी १०८ एकर मध्ये वसलेले आहे.
      लक्ष्मी विलास पॅलेस (गायकवाड वाडा) हा गुजरात च्या वडोदरा शहरातील आलिशान राजवाडा आहे. हा वाडा महाराज श्रीमंत सयाजीराव गायकवाड यांनी बांधला आहे. अहमदाबाद पोहचणे व साबरमती आश्रम पाहणे हे आश्रम महात्मा गांधी यांचा इतिहास व स्वातंत्र्य लढ्यातील योगदान आणि घडामोडी यांचे दर्शन घडविणारे कायमस्वरूपी प्रदर्शन या ठिकाणी उभारले आहे.
      अक्षरधाम मंदिर हे स्वामी नारायण यांचे भारतातील गुजरात राज्या मधील पहिले मंदिर आहे जे १८२२ मध्ये बांधले गेले मंदिर पाहून अहमदाबाद हॉटेल मुक्काम. 
      
      १८ डिसेंबर:- चौथा दिवस
      सकाळी नाष्टा करून मोढेरा येथील सूर्य मंदिर पाहणार आहोत. रावणाचा वध करून परतलेल्या श्रीरामाने गुरु वशिष्ठांना ब्रह्म हत्येच्या पातकातून मुक्त होण्यासाठी काय करावे असे विचारले असता गुरू वशिष्ठांनी धर्मारण्यात जाऊन यज्ञ करण्यास सल्ला दिला मोढेरा जन धारणे नुसार प्रभू श्रीरामांनी आणि सीता मातेने या ठिकाणाला भेट देऊन यज्ञ केला.
      राणी की वाव. गुजरात राज्यात 'बावडी' किंवा 'वाव' या नावाने ओळखल्या जाणाऱ्या अनेक विहिरी आहेत. या विहिरींना पाण्यापर्यंत जाण्यासाठी पायऱ्या असतात तसेच विश्रांतीसाठी मजले, छत आणि हे ठिकाण रमणीय व्हावे म्हणून कोरीव काम केलेले असते. गुजरातमधील पाटण या जिल्ह्याच्या गावी असणारी अशी विहीर 'राणीनी वाव' या नावाने प्रसिद्ध आहे. २२ २०१४ मध्ये युनेस्कोच्या जागतिक वारसा यादीत या स्थळाचा समावेश झाला. तसेच नविन १०० रु च्या नोटेवर तिचा फोटो गौरवार्थ छापलेला आहे रात्री अहमदाबाद स्टेशन वर जाणे रात्री अहमदाबाद ते द्वारका रेल्वे प्रवास.
      
      १९ डिसेंबर:- पाचवा दिवस
      पहाटे १:०० वा द्वारका कडे रेल्वे प्रवास सकाळी ९:३० वा द्वारका मध्ये पोहचणे व हॉटेल मध्ये फ्रेश होऊन बेट द्वारका, बारा ज्योतिर्लिंग पैकी एक नागेश्वर दर्शन आणि इतर स्थळ दर्शन करून द्वारका हॉटेल मुक्काम.
      
      २० डिसेंबर:- सहावा दिवस
      सकाळी नाष्टा करून द्वारकेतील राहिलेली ठिकाणे करून पोरबंदर कडे प्रस्थान पोरबंदर लोकल साईड सीन व पोरबंदर हॉटेल मुक्काम.
      
      २१ डिसेंबर:- सातवा दिवस
      सकाळी नाष्टा करून गिरनार कडे प्रस्थान.
      प्रसिद्ध दत्त मंदिर १०,००० पायऱ्या आहेत. पर्यायी व्यवस्था डोलीने व रोपवे ने अर्ध्या पर्यंत जाता येते तिथून पुढे चालत जावे लागते. गोरक्षनाथ मंदिर जैन मंदिर जवळच आहेत गिरनार पर्वता वरील दत्त पादुका दर्शन व गिरनार हॉटेल मुक्काम.
      
      २२ डिसेंबर:- आठवा दिवस
      सकाळी नाष्टा करून गुजरात मधील सिंहा साठी प्रसिद्ध असलेले सासनगिर जंगल सफारी करून सोमनाथ कडे प्रस्थान बारा ज्योतिर्लिंग पैकी एक सोमनाथ दर्शन व लोकल साईड सीन करून सोमनाथ हाँटेल मुक्काम.
      
      २३ डिसेंबर:- नववा दिवस
      सकाळी नाष्टा करून खरेदी व वेरावळ रेल्वे स्टेशन वरून सकाळी १०:५५ वाजता पुणे साठी ट्रेन.
      
      २४ डिसेंबर:- दहावा दिवस
      सकाळी ७:३५ वाजता पुणे स्टेशन वर पोहचणे.
      🙏 यात्रा समाप्त 🙏
      `
    },
    {
      id: 2,
      date: 'प्रारंभ दिनांक 16 नोव्हेंबर 2023 ',
      name: '🐪 रंगीलो राजस्थान टूर 🐪' ,
      images: [
        'https://media.istockphoto.com/id/1291961188/photo/stunning-view-of-the-hawa-mahal-at-sunset-with-blurred-people-walking-during-the-covid-19.webp?b=1&s=170667a&w=0&k=20&c=1R04uRuM5PbsYSSNE8sPQdqB2z7Pp6vN1D2TA-VsBIQ=',
        'https://media.istockphoto.com/id/1160319335/photo/tourist-enjoy-camel-ride-at-thar-desert-jaisalmer-rajasthan-at-sunset-with-view-of-camel.webp?b=1&s=170667a&w=0&k=20&c=IAP6VY_NdxO9LcBa5Dla2hd_T5poj7F9MeJo9xD_Eag=',
        'https://media.istockphoto.com/id/154894958/photo/amber-fort-jaipur-india.webp?b=1&s=170667a&w=0&k=20&c=dlzNCcKaBY9M9mW7xfyF3oSvcZMEddr-levwG51Q7JQ=',
      ],
      duration: '9 रात्री 11 दिवस      ',
      locations: ['जयपुर, उदयपुर, जोधपूर, बिकानेर, पुष्कर, जैसलमेर, लोंगेवाला बॉर्डर, सम वाळवं      '],
      descriptiondetails:`
      दि.16 नोव्हेंबर :- सकाळी बांद्रा टर्मिनस साठी निघणे दुपारी 12:00 वा ( ट्रेन नं 12216) बांद्रा टर्मिनस ते जयपूर साठी ट्रेन
      
      दि.17 नोव्हेंबर :- जयपूर स्टेशन वर पहाटे 6.00 ला पोहचणे स्टेशन वरून हॉटेल वर जाणे रुम शिल्लक असेल तरच सकाळी रूम मिळेल नाहीतर रिसेप्शनला वेटिंग ला थांबावे लागेल (कारण हॉटेल चेक इन हे दुपारी 12 च्या पुढे असते)
      हॉटेल फ्रेश झाल्यानंतर जयपूर लोकल जयगड, अमेरफोर्ट, हवामहल, जंतरमंतर, जलमहल पाहणे जयपूर हॉटेल मुक्काम.
      
      दि.18 नोव्हेंबर :- सकाळी नाष्टा करून अजमेर ला निघणे 133 कि.मी अजमेर शरीफ दर्गाला( रिक्षा ने जावे लागेल) दर्गा पाहून पुष्कर ला जाणे भारतामधील एकमेव ब्रम्हा मंदिर आणि पुष्कर लेक त्यानंतर सावित्री मंदिर ( रोपवे ने जाणे) पुष्कर हॉटेल मुक्काम.
      
      दि.19 नोव्हेंबर :- सकाळी नाष्टा करून बिकानेर साठी निघणे 252 कि. मी प्रवास करून बिकानेर मधील करणीमाता मंदिर पाहणे ( मंदिरामध्ये देवीचे असंख्य उंदीर पहायला मिळतील पांढरा उंदीर पहायला मिळाला तर नशीबवान) बिकानेर हॉटेल मुक्काम.
      
      दि.20 नोव्हेंबर :- सकाळी नाष्टा करून जैसलमेर साठी निघणे 330 कि.मी प्रवास जैसलमेर वॉर मेमोरियल , लाईट साऊंड शो पाहून रात्री जैसलमेर हॉटेल मुक्काम.
      
       दि.21 नोव्हेंबर :-  सकाळी नाष्टा करून ( रिक्षाने ) जैसलमेर फिरणे, गाडीसर लेक, जैसलमेर किल्ला, पटवा की हवेली पाहणे दुपारी सम वाळवंटा मध्ये जाणे 50 कि.मी प्रवास उंट राईड, रात्री टेंट मध्ये राजस्थान कल्चर डान्स कार्यक्रम टेंट मध्ये मुक्काम.( डेझर्ट वाळवंटा मध्ये आंघोळी साठी खारं पाणी असते )
      
      दि.22 नोव्हेंबर :- सकाळी नाष्टा करून लोंगेवाला बॉर्डर भारत पाकिस्तान इथे युद्ध स्थळ पाहण्यासाठी जाणे 115 कि मी
      प्रवास पाकिस्तान युद्धामध्ये जे जिंकलेले रणगाडे , सर्व हत्यारे वगैरे ते पाहायला मिळतील त्या ठिकाणाहून तनोट माता 50 कि.मी या ठिकाणी जाणार आहे तिथे भारत  पाकिस्तान युद्धा मध्ये बॉम्ब फेकलेले परंतु ते मंदिरावर फुटलेले नाही ते तुम्हाला बॉम्ब मंदिरा मध्ये पाहायला मिळतील रात्री डेझर्ट टेंट मध्ये मुक्काम.
      
      दि.23 नोव्हेंबर :- जैसलमेर डेझर्ट ते जोधपुर 323 कि.मी प्रवास मेहरानगड, जसवंत थाडा, उमेदभवन पॅलेस, पाहून जोधपूर हॉटेल मुक्काम.
      
      दि.24 नोव्हेंबर :- सकाळी नाष्टा करून जोधपूर ते उदयपूर  250 कि.मी प्रवास बुलेट बाबा मंदिर पाहून उदयपूर हॉटेल मुक्काम.
      
      दि.25 नोव्हेंबर :- सकाळी नाष्टा करून उदयपूर लोकल फिरणे सिटी पॅलेस, जगदीश्वर मंदिर, पिचोला लेक, रोप-वे करणी माता मंदिर, सहेली की बाड़ी, महाराणा प्रताप स्मारक, लोक-कला मंडल कठपुतली, फतेहसागर उदयपूर हॉटेल मुक्काम.
      
      दि.26 नोव्हेंबर : - सकाळी नाष्टा करून एकलिंगी शंकराचे प्राचीन मंदिर, नाथद्वारा श्रीकृष्ण मंदिर, महाराणा प्रताप यांचा इतिहास हल्दीघाटी पाहून संध्याकाळी 7 वाजता उदयपूर स्टेशन ड्रॉप रात्री 9.20 वाजता पुणे साठी निघणे.
      
      दि.27 नोव्हेंबर :- पुणे स्टेशन येथे संध्या 4:35 ला पोहचणे.
      
      🙏 टूर समाप्त 🙏
      
      `
    },
    {
      id: 3,
      date: '८ रात्री ९ दिवस (रेल्वे प्रवास सह)      ',
      name: ' भूतान टूर फेब्रुवारी २०२४       ',
      images: [
        'https://media.istockphoto.com/id/914497740/photo/punakha-dzong-monastery-punakha-bhutan.webp?b=1&s=170667a&w=0&k=20&c=_tS3sUkoAc3yWbaIPUmXDJhc5qnrgxDIl-D5cMZ8jbk=',
        'https://media.istockphoto.com/id/1408816132/photo/beautiful-thimphu.webp?b=1&s=170667a&w=0&k=20&c=iRF7OgnnnyTxRrusE4U2oL4MjqzChPUZqnDWBdIOy3U=',
        'https://media.istockphoto.com/id/1183079736/photo/golden-buddha-statue-in-bhutan.webp?b=1&s=170667a&w=0&k=20&c=cLkgD4L3BBYsJtC1drBHE94HP4shBiyHPARTL9p2IDo=',
      ],
      duration: '6 days',
      locations: ['Ancient Ruins', 'Museums', 'Cultural Heritage'],
      descriptiondetails:`
      १३ फेब्रु :- कल्याण ते हशिमारा रेल्वे प्रवास ( रेल्वे प्रवास २ दिवस )
      
      १४ फेब्रु :- दिवसभर रेल्वे प्रवास. 
      
      १५ फेब्रु :- हशिमारा रेल्वे स्टेशन वर ८:३० ला पोहचून नंतर लगेच जयगांवकडे रवाना (२० कि.मी.) 
      जयगांव हे भारता मधील शेवटचे गांव भूतान बॉर्डर वर फुन्सशलिंग येथे परमिट काढून आपण भूतान मध्ये प्रवेश करणार आहोत, भूतानची राजधानी थिम्पू या शहरात पोहचून थिम्पू हॉटेल मुक्काम.
       
       १६ फेब्रु :- नाश्ता करून थिम्पू दर्शन यामध्ये चोर्टन टेम्पल, थिंम्पू झॉन्ग ( किल्ला), थिंपू संग्रहालय, बुद्धा पॉईंट पाहून थिंम्पू मार्केट मध्ये खरेदी करून थिम्पू हॉटेल मुक्काम. 
      
      १७ फेब्रु :- सकाळी नाश्ता करून भूतानची धार्मिक राजधानी पुनाखा येथे जाणार आहोत. सर्वांत लांब पुनाखा सस्पेन्शन ब्रिज, मोचू आणि पोचू नद्यांच्या मध्ये असलेला सर्वात सुंदर पुनाखा झॉन्ग पाहणार आहोत भूतान मधील सर्व पारंपरिक व धार्मिक सण उत्सव याच ठिकाणावरून सुरु होतात. संध्याकाळी पारो हॉटेल मुक्काम.
       
      १८ फेब्रु :- सकाळी नाश्ता करून पारो झॉन्ग आणि दुसऱ्या शतकातील किचू मॉनेस्ट्री मार्केट मध्ये शॉपिंग करून मुक्काम पारो हॉटेल मुक्काम.
      
      १९ फेब्रु :- सकाळी नाष्टा करून टायगर नेस्ट मॉनेस्टरी साठी जाणे ४ तास पायी ट्रेक पारो हॉटेल मुक्काम.
      
      २० फेब्रु :- सकाळी नाश्ता करून लतागुरी येथे जाणार आहोत. लतागुरी हे एकशिंगी गेंडा व हातींसाठी प्रसिद्ध ठिकाण आहे. लतागुरी हॉटेल मुक्काम.
            
      २१ फेब्रु :- सकाळी नाश्ता करून बागडोगरा विमानतळाकडे प्रस्थान - बागडोगरा ते पुणे/ मुंबई विमान प्रवास पुणे / मुंबई पोहचणे सहल समाप्त.
      
      `
    },
    {
      id: 4,
      date: '2023-10-01',
      name: '🛕 काशी गया,अयोध्या, प्रयागराज.       ',
      images: [
        'https://media.istockphoto.com/id/1479967101/photo/mughal-period-architecture-tomb-of-khusro-nithar-and-mann-bai-in-prayagraj-city-formerly.webp?b=1&s=170667a&w=0&k=20&c=CFDulBNBvJUF2Ht3sKg_oWefmis3AzRu9dyWsk30jdA=',
        'https://media.istockphoto.com/id/1287252808/photo/ram-temple-ayodhya.webp?b=1&s=170667a&w=0&k=20&c=YgRshkXUGcl7Vtu2Gvax9lDIfbXE4Aac5pZa5l45CYw=',
        'https://media.istockphoto.com/id/827065008/photo/holy-town-varanasi-and-the-river-ganges.webp?b=1&s=170667a&w=0&k=20&c=VuRZoKcBSjIkDHKCzJOXMOHY6jtFq5qLaVZrx4g4lKE=',
      ],
      duration: '7 days',
      locations: ['  वाराणसी.', 'बौद्धगया', ' अयोध्या' ,'प्रयागराज अहलाबाद '],
      descriptiondetails:`🛕 काशी गया,अयोध्या, प्रयागराज. 🛕

      🚩🕉 खास लोक आग्रहास्तव त्रिस्थळी धार्मिक यात्रा. 🕉🚩 
      
      विष्णू गया*मंदिरामध्ये  शिळे वरती प्रत्यक्ष विष्णुपद. पित्र दोषातून मुक्त होण्यासाठी येथे पिंडदान करतात.
      
          वाराणसी. श्री काशी विश्वेश्वर दर्शन. गंगा स्नान गंगा आरती गंगेतून नावेमधून ऐंशी घाटाची दर्शन काळभैरव दर्शन.
      
      बौद्धगया  जेथे गौतम बुद्धांनी ज्ञानसाधना केली तो वटवृक्ष व विविध देशातील बौद्ध विहारांचे अप्रतिम दर्शन.
      
      प्रयागराज अहलाबाद
      कुंभमेळ्याचे प्रमुख ठिकाण गंगा जमुना सरस्वती या तीन नद्यांचा संगम झोपलेला मारुती.
      
       अयोध्या  प्रभू श्री राम जन्मभूमी, हनुमान गढी, राजा दशरथ राजवाडा.
      
      सहल खर्च एक व्यक्ती 9,999/-  रुपये (नॉन एसी स्लीपर क्लास रेल्वे प्रवास)
      
      ॲडव्हान्स बुकिंग रक्कम एक व्यक्ती 3,000/- (नॉन रिफंडेबल)
      
      सहल खर्च एक व्यक्ती 13,000/-  रुपये ( एसी थ्री टियर स्लीपर क्लास रेल्वे प्रवास)
      
      ॲडव्हान्स बुकिंग रक्कम एक व्यक्ती 5,000/- (नॉन रिफंडेबल)
      
      पॅकेज मधील समाविष्ट बाबी
      ➡सकाळी चहा नाष्टा, व  दुपारी हलका आहार आणि रात्रीचे पोठबर जेवण जार चे फिल्टर पाणी.
      ➡प्रवास नॉन एसी टू बाय टू  लक्झरी बस.
      ➡निवास व्यवस्था नॉन एसी रूम  एक रूम मध्ये 3 किंवा 4 व्यक्ती.
      ➡कराड ते कराड नॉन एसी सिटिंग रेल्वे प्रवास.
      
      सहलीची दैनंदिनी
      16 जानेवारी दिवस पहिला. सकाळी दहा वाजता कराड हुन कोयना एक्सप्रेस ने कल्याण कडे रवाना.व रात्री दहा वाजता कल्याणहुन कोलकत्ता एक्सप्रेस ने गया कडे प्रस्थान .
      
      17 जानेवारी दिवस दुसरा. दिवसभर रेल्वे प्रवास.
      
      18 जानेवारी दिवस तिसरा. पहाटे तीन वाजता वाजता श्री तीर्थक्षेत्र गया मध्ये आगमन. फ्रेश होऊन नाष्टा करून श्री विष्णू पद विष्णु पादुका मंदिर कडे रवाना विष्णू पादुका दर्शन. श्री तीर्थक्षेत्र फाल्गुनी नदी दर्शन. 
      व श्री तीर्थक्षेत्र बौद्ध गया कडे रवाना. श्री बौद्ध गया येथील बौद्ध वटवृक्ष जेथे श्री गौतम बुद्धांनी दीक्षा घेतली ते ठिकाण व प्रत्येक बुद्धिष्ट देशांनी बांधलेली सुवर्ण मंदिरे भव्य बौद्ध मूर्ती पाहून रात्री जेवण करून अकरा वाजता बनारस कडे रवाना व बनारस (काशी)मुक्काम.
      
       19 जानेवारी दिवस चौथा. श्री काशी स्नान गंगा स्नान व श्री बारा ज्योतिर्लिंगापैकी एक श्री काशी विश्वेश्वराचे दर्शन.नौकेतून 80 घाटाचे दर्शन व सायंकाळी गंगा आरती श्री कमळ भैरव म्हणजेच काळभैरव दर्शन व बनारस काशी मुक्काम.
      
       20 जानेवारी दिवस पाचवा. सकाळी नाश्ता करून अलाबाद कडे रवाना दुपारी आलाबाद प्रयाग येथील त्रिवेणी संगम गंगा यमुना सरस्वती त्रिवेणी संगमावर स्नान. लंका दहन करून आल्यानंतर श्री हनुमंताचे झोपलेले ठिकाण. व रात्री अलाहाबाद किंवा वाराणसी मुक्काम.
      
       21 जानेवारी दिवस सहावा. अयोध्या श्री राम जन्म भूमि, राम मंदिर, हनुमान गढी, श्री राजा दशरथ राजवाडा.
      
      22 जानेवारी दिवस सातवा. पहाटे साडेपाच वाजता किंवा साडेसात वाजता रेल्वे ने पुणे किंवा मुंबई कडे रवाना.
      
      23 जानेवारी दिवस आठवा. सायंकाळी 4 वाजता कराड येथे आगमन व यात्रा समाप्त.
      
      सदर यात्रा हिंदू धर्मा मध्ये मातृ पितृ ऋणातून मुक्त होण्यासाठी केली जाते
      
      खर्चा मध्ये समाविष्ट नसलेल्या बाबी खालील प्रमाणे
       रेल्वे प्रवासा मधील जेवण,प्रवेश फी, पुजा विधी, दान धर्म, रिक्षा, बोट खर्च, बिसलेरी पाणी, इत्यादी. या सर्व गोष्टींचा खर्च स्वतःला करावा लागेल. 
      `
    },
    {
      id: 5,
      date: '२७ फेब्रु ते ६ मार्च २०२४    ',
      name: ' 🌲शिमला कुलू मनाली टुर 🌲',
      images: [
        'https://media.istockphoto.com/id/1367667619/photo/village-in-mountain-range.webp?b=1&s=170667a&w=0&k=20&c=YILNL-HZt_QATX_KkJStjIKwYK4WNTTTmpKKvGi4Btc=',
        'https://media.istockphoto.com/id/1091491850/photo/view-of-shimla-india.webp?b=1&s=170667a&w=0&k=20&c=X2k72_CpS6KZvNERR_1rzLt-slLsjx-hJGpzHdwgrSw=',
        'https://media.istockphoto.com/id/1437480419/photo/beautiful-winter-scenery-at-the-himalaya-trekking-bhutan.webp?b=1&s=170667a&w=0&k=20&c=51VU0LsnA4ZussHe4keSHWGdAr_LOXylf49jC5v1J7s=',
      ],
      duration: '🏔२ रात्र शिमला-३ रात्र मनाली',
      locations: [''],
      descriptiondetails:`
      `
    },
    {
      id: 6,
      date: '2023-08-22',
      name: '🌴 अंदमान टूर पॅकेज 🌴',
      images: [
        'https://media.istockphoto.com/id/526836625/photo/palm-beach.webp?b=1&s=170667a&w=0&k=20&c=l59wTZU6XUagtWqTXsfEFsyuFxz52n0y3bV_NbdPGII=',
        'https://media.istockphoto.com/id/496923233/photo/island-beach.webp?b=1&s=170667a&w=0&k=20&c=gNTP7Cbvf8_17mgSnipZVEKe1Ztt0lks22fBzJ4VTUU=',
        'https://images.unsplash.com/photo-1631364377744-2d0a1e5c40cf?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NXx8YW5kYW1hbiUyMGFuZCUyMG5pY29iYXIlMjBpc2xhbmRzfGVufDB8fDB8fHww',
      ],
      duration: ' टूर कालावधी ७ रात्री ८ दिवस      ',
      locations: [' पोर्टब्लेअर, नॉर्थ बे आयलंड आणि रोझ आयलंड, हॅवलॉक आयलंड, नील आयलंड, बारटांग आयलंड आणि चिडिया टापू      '],
    },
   
  ]);

 
    

function Arrow(props){
   const{className , style , onClick} = props;
   return(
  <div
  className={className}
  style={{...style , display: "block" , background: "black"}}
  onClick={onClick}
  />
   )
} 
  const settings = {
  dots: true,
  infinite: true,
  speed: 500,
  slidesToShow: 1,
  slidesToScroll: 1,
  prevArrow: <Arrow />,
  nextArrow: <Arrow />,
};

const [detail, setDetail] = useState([]);

const detailPage = (tour) => {
  setDetail([{ ...tour }]);
};


  return (
    <>

<div className={`detail_container ${detail.length > 0 ? 'active' : ''}`}>
        <div className='contant'>
          {detail.map((x) => (
            <div className='detail_info' key={x.id}>
              <div className='img-box'>
                {/* Assuming x.images is an array */}
                {x.images && x.images.length > 0 && (
                  <Slider {...settings}>
                    {x.images.map((image, index) => (
                      <img key={index} src={image} alt={`Tour ${x.id} - Image ${index + 1}`} />
                    ))}
                  </Slider>
                )}
              </div>
              <div className='product_detail'>
                <h3>{`Date: ${x.date}`}</h3>
                <h3>{`Name: ${x.name}`}</h3>
                <h3>{`Duration: ${x.duration}`}</h3>
                <h3>{`Locations: ${x.locations.join(', ')}`}</h3>
                <p className='paragraph'>
                  {`descriptiondetails:${x.descriptiondetails}`}
                </p>
              </div>
            </div>
          ))}
           <button className="close-btn" onClick={() => setDetail([])}>Close</button>
        </div>
      </div>



      <div>
        <h1 className='abcd'>Out Tours...</h1>
      </div>
      <div className='tour-package'>
        {tourPackages.map((tour) => (
          <div key={tour.id} className='tour-item'>
            <p className='tour-date'>{`Date: ${tour.date}`}</p>
            <Slider {...settings}>
              {tour.images.map((image, index) => (
                <img key={index} src={image} alt={`Tour ${tour.id} - Image ${index + 1}`} />
              ))}
            </Slider>
            <hr />
            <h2 className='tour-name'>{tour.name}</h2>
            <p className='tour-duration'>{`Duration: ${tour.duration}`}</p>
            <p className='tour-locations'>{`Locations: ${tour.locations.join(', ')}`}</p>
            <button className='view-package-btn' onClick={() => detailPage(tour)}>
              View Package detail
            </button>
          </div>
        ))}
      </div>

        </>
    
  );
};

export default DTourpackges;
